LonelyWolf/stm32/stm32l151rdt6-dev/ST7541.c
// Set X coordinate mapping (normal or mirrored)
// Input:
//   state: NORMAL or INVERT
// Doesn't affect the display memory
void ST7541_SetXDir(InvertStatus MX) {
	ST7541_CS_L();
	ST7541_cmd(MX == NORMAL ? 0xa0 : 0xa1); // SEG direction select
	ST7541_CS_H();
}

// Set Y coordinate mapping (normal or mirrored)
// Input:
//   state: NORMAL or INVERT
// Doesn't affect the display memory
void ST7541_SetYDir(InvertStatus MY) {
	ST7541_CS_L();
	ST7541_cmd(MY == NORMAL ? 0xc8 : 0xc0); // COM direction select
	ST7541_CS_H();
}

// Set display column:page according to pixel coordinates
// Input:
//   X, Y - pixel coordinates
void ST7541_SetAddr(uint8_t X, uint8_t Y) {
	ST7541_CS_L();
	ST7541_cmd(X & 0x0f); // Column address LSB
	ST7541_cmd(0x10 | ((X > 4) & 0x07)); // Column address MSB
	ST7541_cmd(0xb0 | ((Y / 8) & 0x0f)); // Page address
	ST7541_CS_H();
}

// Set scroll line number
// Input:
//   line - start line number (0..127)
void ST7541_SetScrollLine(uint8_t line) {
	ST7541_CS_L();
	ST7541_cmd_double(0x40,line & 0x7f); // Set initial display line
	ST7541_CS_H();
}

// Set display orientation
void ST7541_Orientation(uint8_t orientation) {
	ST7541_CS_L();
	switch(orientation) {
	case scr_CW:
		scr_width  = SCR_H;
		scr_height = SCR_W;
		ST7541_SetXDir(NORMAL);
		ST7541_SetYDir(NORMAL);
		break;
	case scr_CCW:
		scr_width  = SCR_W;
		scr_height = SCR_H;
		ST7541_SetXDir(INVERT);
		ST7541_SetYDir(INVERT);
		break;
	case scr_180:
		scr_width  = SCR_W;
		scr_height = SCR_H;
		ST7541_SetXDir(NORMAL);
		ST7541_SetYDir(INVERT);
		break;
	default:
		scr_width  = SCR_H;
		scr_height = SCR_W;
		ST7541_SetXDir(INVERT);
		ST7541_SetYDir(NORMAL);
		break;
	}
	scr_orientation = orientation;
	ST7541_CS_H();
}

// Send vRAM buffer into display
void ST7541_Flush(void) {
	// Send video buffer with SPI 16-bit frame
	ST7541_SetAddr(0,0);
	ST7541_CS_L();
	ST7541_RS_H();
	// Disable the SPI peripheral, set 16-bit data frame format and then enable the SPI back
	ST7541_SPI_PORT.Instance->CR1 &= ~SPI_CR1_SPE;
	ST7541_SPI_PORT.Instance->CR1 |= SPI_CR1_DFF | SPI_CR1_SPE;
	// Send buffer
	SPIx_SendBuf16(&ST7541_SPI_PORT,(uint16_t *)&vRAM[0],(SCR_W * SCR_H) >> 3);
	ST7541_CS_H();
	// Disable the SPI peripheral, set 8-bit data frame format and then enable the SPI back
	ST7541_SPI_PORT.Instance->CR1 &= ~(SPI_CR1_DFF | SPI_CR1_SPE);
	ST7541_SPI_PORT.Instance->CR1 |= SPI_CR1_SPE;

/*
	// Send video buffer with SPI 8-bit frame
	ST7541_SetAddr(0,0);
	ST7541_CS_L();
	ST7541_RS_H();
	SPIx_SendBuf(ST7541_SPI_PORT,vRAM,(SCR_W * SCR_H) >> 2);
	ST7541_CS_H();
*/
}

// Send vRAM buffer into display using DMA
// input:
//   blocking: blocking or non-blocking operation (BLOCK/NOBLOCK)
// note: in case of blocking operation this function waits for the end of transmit
//       in case of non-blocking operation the application must deassert the CS pin
//       after end of transmit (or call the ST7541_Wait_Flush())
void ST7541_Flush_DMA(BlockingState blocking) {
	ST7541_SetAddr(0,0);
	ST7541_CS_L();
	ST7541_RS_H();
	// Configure the DMA transfer
	SPIx_Configure_DMA_TX(&ST7541_SPI_PORT,vRAM,(SCR_W * SCR_H) >> 2);
	// Enable the DMA channel
	SPIx_SetDMA(&ST7541_SPI_PORT,SPI_DMA_TX,ENABLE);
	if (blocking == BLOCK) {
		// Wait while DMA transaction ongoing
		while (ST7541_SPI_PORT.DMA_TX.State == DMA_STATE_BUSY);
	}
//	if (blocking == BLOCK) ST7541_Wait_Flush();
}

// Waits for the DMA transmission ends
void ST7541_Wait_Flush(void) {
	// Wait until DMA transfer is over
	while (!(ST7541_SPI_PORT.DMA_TX.Instance->ISR & ST7541_SPI_PORT.DMA_TX.TCIF));
	// Disable the DMA channel
	SPIx_SetDMA(&ST7541_SPI_PORT,SPI_DMA_TX,DISABLE);
	// Ensure that the SPI communication is complete
	while (!(ST7541_SPI_PORT.Instance->SR & SPI_SR_TXE));
	while (ST7541_SPI_PORT.Instance->SR & SPI_SR_BSY);
	ST7541_CS_H();
}

// Fill vRAM memory with specified pattern
// input:
//   pattern - byte to fill vRAM buffer
void ST7541_Fill(uint16_t pattern) {
	uint16_t i;
	union {
		uint16_t w;
		struct {
			uint8_t b1;
			uint8_t b0;
		};
	} p;

	p.w = pattern;
	for (i = 0; i < (SCR_W * SCR_H) >> 2; ) {
		vRAM[i++] = p.b1;
		vRAM[i++] = p.b0;
	}
}

// Set pixel in vRAM buffer
// input:
//   X, Y - pixel coordinates
//   GS - grayscale pixel color (gs_[white,ltgray,dkgray,black])
void Pixel(uint8_t X, uint8_t Y, GrayScale_TypeDef GS) {
	uint32_t *pvRAM_BB;

	// Offset of pixel in the vRAM array must be computed by formula ((Y >> 3) * (SCR_W << 1)) + (X << 1)
	// But ST7541 screen width 128, therefore formula can be simplified to ((Y >> 3) << 8) + (X << 1)

	// Compute RAM address for bit-banding
	if (scr_orientation == scr_CW || scr_orientation == scr_CCW) {
		// Swap X and Y coordinates if screen rotated for 90 degrees (clockwise or counter-clockwise)
		pvRAM_BB = (uint32_t*)(SRAM_BB_BASE + (((uint32_t)((void*)(&vRAM[((X >> 3) << 8) + (Y << 1)])) - SRAM_BASE) << 5) + (((uint32_t)(X % 8)) << 2));
	} else {
		pvRAM_BB = (uint32_t*)(SRAM_BB_BASE + (((uint32_t)((void*)(&vRAM[((Y >> 3) << 8) + (X << 1)])) - SRAM_BASE) << 5) + (((uint32_t)(Y % 8)) << 2));
	}

	// Set bits in vRAM according to specified color
	if (GS == gs_ltgray) {
		*pvRAM_BB = 0; *(pvRAM_BB + 8) = 1;
	} else if (GS == gs_black){
		*pvRAM_BB = 1; *(pvRAM_BB + 8) = 1;
	} else if (GS == gs_dkgray) {
		*pvRAM_BB = 1; *(pvRAM_BB + 8) = 0;
	} else {
		// gs_white (in case of invalid GS value pixel will be cleared)
		*pvRAM_BB = 0; *(pvRAM_BB + 8) = 0;
	}

/*
	// Draw pixel without bit-banding (add 88 bytes of code compared to bit-banding)
	uint8_t  XX;
	uint8_t  YY;
	uint8_t  bit;
	uint16_t *pvRAM;

	if (scr_orientation == scr_CW || scr_orientation == scr_CCW) {
		// Swap coordinates if screen rotated to 90 degrees
		XX = Y;
		YY = X;
	} else {
		XX = X;
		YY = Y;
	}

	// Vertical shift in byte of video buffer
	bit = 1 << (YY % 8);

	// Calculate offset in video buffer
	pvRAM = (uint16_t *)&vRAM[((YY >> 3) << 8) + (XX << 1)]; // screen width 128, therefore this a bit faster

	if (GS == gs_white) {
		*pvRAM &= ~(bit | (bit << 8));
	} else if (GS == gs_black) {
		*pvRAM |=  (bit | (bit << 8));
	} else if (GS == gs_dkgray) {
		*pvRAM &= ~(bit | (bit << 8));
		*pvRAM |=   bit;
	} else {
		// gs_ltgray
		*pvRAM &= ~(bit | (bit << 8));
		*pvRAM |=  (bit << 8);
	}
*/
}

// Draw horizontal line
// input:
//   X1, X2 - left and right horizontal coordinates (X1 must be less than X2)
//   Y - vertical coordinate
//   GS - grayscale pixel color
void HLine(uint8_t X1, uint8_t X2, uint8_t Y, GrayScale_TypeDef GS) {
	uint8_t X,eX;

